# Technium

<details>
<summary>4.1 Декораторы</summary>

[link](https://github.com/PavLikh/Technium/tree/master/04-algorithms_data_structures/4-1-decorators)

## Задача 1.
Измерьте с помощью декоратора measure_execution_time продолжительность HTTP запроса к произвольному url (можно взять код из первых уроков по ботам)

## Задача 2. 
Описание задачи:

Необходимо разработать декоратор requires_admin, который будет использоваться для проверки роли пользователя перед выполнением защищенной функции. Если роль пользователя не соответствует требуемой, декоратор должен выбрасывать исключение PermissionError. В противном случае функция должна выполняться корректно.

### Пример использования:

Функция delete_user отвечает за удаление пользователей. Она должна быть доступна только для пользователей с ролью "admin".  Если пользователь, вызывающий эту функцию, не является администратором, необходимо остановить выполнение функции и выбросить PermissionError.

 
```python
@requires_admin
def delete_user(user, username_to_delete):
    return f"User {username_to_delete} has been deleted by {user['username']}."
```
### Пример юзеров
```python
admin_user = {'username': 'Alice', 'role': 'admin'}
regular_user = {'username': 'Bob', 'role': 'user'}
```

### Вызовы функции
```python
print(delete_user(admin_user, 'Charlie')) # Должно отработать
print(delete_user(regular_user, 'Charlie')) # Должно рейзить PermissionError
```

</details>
<details>
<summary>4.5 Задача (последовательность скобок)</summary>

[link](https://github.com/PavLikh/Technium/tree/master/04-algorithms_data_structures/4-5-task)

## Описание задачи
Необходимо написать программу, которая проверяет, является ли данная строка правильной скобочной последовательностью. Правильной скобочной последовательностью считается последовательность, в которой каждая открывающая скобка (например, '(', '{', '[') имеет соответствующую закрывающую скобку (')', '}', ']'). При этом скобки должны быть правильно вложены друг в друга, и порядок их следования должен быть корректным.

Примеры:

Правильная скобочная последовательность: "([]{})"
Неправильная скобочная последовательность: "([)]"
Неправильная скобочная последовательность: "{[}"
Правильная скобочная последовательность: "()"

Задача включает в себя следующие шаги:

- Считать строку, содержащую скобочную последовательность.
- Используя стек, проверить каждую скобку в строке.
- Если текущая скобка - открывающая, добавить ее в стек.
- Если текущая скобка - закрывающая, проверить, соответствует ли она последней открывающей скобке в стеке. Если да, удалить последнюю открывающую скобку из стека и продолжить проверку. В противном случае, скобочная последовательность неправильна.
- По завершении проверки всех символов в строке, проверить, остались ли какие-либо непарные скобки в стеке. Если да, скобочная последовательность также считается неправильной.

Результатом выполнения программы должно быть сообщение о том, является ли данная строка правильной скобочной последовательностью или нет. В идеале код должен содержать реализацию класса Стек и функцию для проверки строки со скобками. 
</details>